{
  "project_description":[
    {"description": "\"A record company has decided to create a database with the information about it's musician as well as other company information. The information given to the designer were:\""},
    {"col1": [
      {"item1":"Each artist has an id, name, address and a cell phone number. The musician at the beginning of their career they often share an address and, furthermore, it is assumed that each address only has one telephone number."},
      {"item2":"Each musician can belong to one or more bands."},
      {"item3":"Each instrument used in the studios has a name (e.g. guitar, drums, etc.) and an internal code."},
      {"item4":"Each disc recorded at the company has a title, a date, a format (e.g. CD, MC, K7), and a disc identifier."}
    ]},
    {"col2": [
      {"item1":"Each song recorded by the company has a title and authors.,"},
      {"item2":"Each musician can play multiple instruments, and each instrument can be played by multiple musicians.,"},
      {"item3":"Each record belongs to a musician or a band and has a certain number of songs, but each song can appear on one or more records.,"},
      {"item4":"Each song can feature several musicians or bands, and each musician or panel can participate in several songs.,"},
      {"item5":"Each record has a producer. Producers can produce multiple records."}
    ]}
  ],
  "points":[
    {"point1":{
      "question":"What did I learn?",
      "answear": "In this project I learned the frameworj Django, how to use it for the Front-End and how to connect it with a DB like postgress and MongoDB, using the framework I tried to make ma pages and components more abstract, making the form of the html the same but the content inside different."
    }},
    {"point2":{
      "question":"What was the most difficult?",
      "answear":"I believe the most difficult part that I passed was passing information between pages, \"How can I inform the user is going for item X\", \"How can I pass this ID for that page?\", \"How can I pass this object for that page?\""
    }},
    {"point3":{
      "question":"How would I improve the project?",
      "answear":"I would search for part were I can make them abstract, show in the Front-End more of the DB that was made, for example the connections of each musician and bands to each instruments, who shared numbers and address and who not. Would ask for more help for the UX too."
    }},
    {"point4":{
      "question":"What do I want to learn next?",
      "answear":"As I started looking for jobs I noticed a demand for React, Angular, Typescript, MongoDB. So I aim to learn them, but I also aim to improve my coding skills, and if there is a way to code faster and with quality I would like to learn how too. So basically I aim to learn what is asked in the market but also to improve my base."
    }}
  ]
}